<div style="text-align: center;">
    <h1>Pandas Concatenate Dataframes</h1>
</div>

<span style="color: blue;"> **Basic Concatenation**</span>

Pandas Concat function is used to join or append dataframes.

In [ ]:
import pandas as pd

bd_weather = pd.DataFrame({
    "city": ["sylhet", "rajshahi", "dhaka"],
    "temperature": [32, 45, 30],
    "humidity": [80, 60, 78],
})

bd_weather

       city  temperature  humidity
0    sylhet           32        80
1  rajshahi           45        60
2     dhaka           30        78

In [3]:
us_weather = pd.DataFrame({
    "city": ["georgia", "new york", "chicago"],
    "temperature": [21, 14, 35],
    "humidity": [68, 65, 75],
})

us_weather

       city  temperature  humidity
0   georgia           21        68
1  new york           14        65
2   chicago           35        75

In [ ]:
# combine to dataframes into one df. 
df = pd.concat([bd_weather, us_weather])
df

       city  temperature  humidity
0    sylhet           32        80
1  rajshahi           45        60
2     dhaka           30        78
0   georgia           21        68
1  new york           14        65
2   chicago           35        75

<span style="color: blue;">**Ignore Index**</span>

In [5]:
df = pd.concat([bd_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0    sylhet           32        80
1  rajshahi           45        60
2     dhaka           30        78
3   georgia           21        68
4  new york           14        65
5   chicago           35        75